from Scrapy_Qianzhan_V1.settings import PROVINCES, Dir
from Scrapy_Qianzhan_V1.file import cate1, cate2, cate3, cate4

AREA = {
    '安徽': ['亳州', '六安', '合肥', '安庆', '宣城', '宿州', '巢湖', '池州', '淮北', '淮南', '滁州', '芜湖', '蚌埠', '铜陵', '阜阳', '马鞍山', '黄山'],
    '澳门': ['澳门'],
    '北京': ['北京'],
    '重庆': ['重庆'],
    '福建': ['三明', '南平', '厦门', '宁德', '泉州', '漳州', '福州', '莆田', '龙岩'],
    '甘肃': ['临夏', '兰州', '嘉峪关', '天水', '定西', '平凉', '庆阳', '张掖', '武威', '甘南', '白银', '酒泉', '金昌', '陇南'],
    '广东': ['东莞', '中山', '云浮', '佛山', '广州', '惠州', '揭阳', '梅州', '汕头', '汕尾', '江门', '河源', '深圳', '清远', '湛江', '潮州', '珠海', '肇庆',
           '茂名', '阳江', '韶关'],
    '广西': ['北海', '南宁', '崇左', '来宾', '柳州', '桂林', '梧州', '河池', '玉林', '百色', '贵港', '贺州', '钦州', '防城港'],
    '贵州': ['六盘水', '安顺', '毕节', '贵阳', '遵义', '铜仁', '黔东南', '黔南', '黔西南'],
    '海南': ['三亚', '海口', '青海州'],
    '河北': ['保定', '唐山', '廊坊', '张家口', '承德', '沧州', '石家庄', '秦皇岛', '衡水', '邢台', '邯郸'],
    '黑龙江': ['七台河', '伊春', '佳木斯', '双鸭山', '哈尔滨', '大兴安岭', '大庆', '牡丹江', '绥化', '鸡西', '鹤岗', '黑河', '齐齐哈尔'],
    '河南': ['三门峡', '信阳', '南阳', '周口', '商丘', '安阳', '平顶山', '开封', '新乡', '洛阳', '济源', '漯河', '濮阳', '焦作', '许昌', '郑州', '驻马店',
           '鹤壁'],
    '湖北': ['仙桃', '十堰', '咸宁', '天门', '孝感', '宜昌', '恩施', '武汉', '潜江', '神农架', '荆州', '荆门', '襄樊', '鄂州', '随州', '黄冈', '黄石'],
    '湖南': ['娄底', '岳阳', '常德', '张家界', '怀化', '株洲', '永州', '湘潭', '湘西', '益阳', '衡阳', '邵阳', '郴州', '长沙'],
    '江苏': ['南京', '南通', '宿迁', '常州', '徐州', '扬州', '无锡', '泰州', '淮安', '盐城', '苏州', '连云港', '镇江'],
    '江西': ['上饶', '九江', '南昌', '吉安', '宜春', '抚州', '新余', '景德镇', '萍乡', '赣州', '鹰潭'],
    '吉林': ['吉林', '四平', '延边', '松原', '白城', '白山', '辽源', '通化', '长春'],
    '辽宁': ['丹东', '大连', '抚顺', '朝阳', '本溪', '沈阳', '盘锦', '营口', '葫芦岛', '辽阳', '铁岭', '锦州', '阜新', '鞍山'],
    '内蒙古': ['乌兰察布', '乌海', '兴安盟', '包头', '呼伦贝尔', '呼和浩特', '巴彦淖尔', '赤峰', '通辽', '鄂尔多斯', '锡林郭勒', '阿拉善'],
    '宁夏': ['中卫', '吴忠', '固原', '石嘴山', '银川'],
    '青海': ['果洛', '海东', '海北', '海南州', '海西', '玉树', '西宁', '黄南'],
    '山东': ['东营', '临沂', '威海', '德州', '日照', '枣庄', '泰安', '济南', '济宁', '淄博', '滨州', '潍坊', '烟台', '聊城', '莱芜', '菏泽', '青岛'],
    '上海': ['上海'],
    '陕西': ['咸阳', '商洛', '安康', '宝鸡', '延安', '榆林', '汉中', '渭南', '西安', '铜川'],
    '山西': ['太原市', '大同市', '阳泉市', '长治市', '晋城市', '朔州市', '忻州市', '晋中市', '临汾市', '吕粱市', '运城市', '原平市', '潞城市', '候马市', '古交市',
           '孝义市', '介休市', '永济市', '汾阳市'],
    '四川': ['乐山', '内江', '凉山', '南充', '宜宾', '巴中', '广元', '广安', '德阳', '成都', '攀枝花', '泸州', '甘孜', '眉山', '绵阳', '自贡', '资阳', '达州',
           '遂宁', '阿坝', '雅安'],
    '台湾': ['台湾'],
    '天津': ['天津'],
    '香港': ['香港'],
    '新疆': ['乌鲁木齐', '五家渠', '伊犁', '克孜勒苏', '克拉玛依', '博尔塔拉', '吐鲁番', '和田', '哈密', '喀什', '图木舒克', '塔城', '巴音郭楞', '昌吉', '石河子',
           '铁门关', '阿克苏', '阿勒泰', '阿拉尔'],
    '西藏': ['山南', '拉萨', '日喀则', '昌都', '林芝', '那曲', '阿里'],
    '云南': ['临沧', '丽江', '保山', '大理', '德宏', '怒江', '文山', '昆明', '昭通', '普洱', '曲靖', '楚雄', '玉溪', '红河', '西双版纳', '迪庆'],
    '浙江': ['丽水', '台州', '嘉兴', '宁波', '杭州', '温州', '湖州', '绍兴', '舟山', '衢州', '金华'],
}


def func():
#     # print(len(PROVINCES['all']), len(PROVINCES['city']))
    for i, c in Dir.items():
        cate = f'"{i}": "{c}",'
        with open(r'E:\Building\Data\Spider\Scrapy_Qianzhan_V1\Scrapy_Qianzhan_V1\file.txt', 'a',
                  encoding='utf-8') as f:
            f.write(cate + '\n')

        n = 5
        for p, cc in AREA.items():
            if n < 10:
                parent_id = f'{i}00{n}'
            elif (n >= 10) and (n < 100):
                parent_id = f'{i}0{n}'
            elif n >= 100:
                parent_id = f'{i}{n}'

            n += 1

            cate = f'"{parent_id}": "{p}",'
            with open(r'E:\Building\Data\Spider\Scrapy_Qianzhan_V1\Scrapy_Qianzhan_V1\file.txt', 'a',
                      encoding='utf-8') as f:
                f.write(cate + '\n')

            m = 1

            if len(cc) != 1:
                p_id = f'{parent_id}00{m}'
                a_prevince = f'"{p_id}": "全省", '
                with open(r'E:\Building\Data\Spider\Scrapy_Qianzhan_V1\Scrapy_Qianzhan_V1\file.txt', 'a',
                          encoding='utf-8') as f:
                    f.write(a_prevince + '\n')

                m += 1

                for ccc in cc:

                    if m < 10:
                        p_id = f'{parent_id}00{m}'
                    elif (m >= 10) and (m < 100):
                        p_id = f'{parent_id}0{m}'
                    elif m >= 100:
                        p_id = f'{parent_id}{m}'

                    m += 1

                    cate = f'"{p_id}": "{ccc}",'
                    with open(r'E:\Building\Data\Spider\Scrapy_Qianzhan_V1\Scrapy_Qianzhan_V1\file.txt', 'a',
                              encoding='utf-8') as f:
                        f.write(cate + '\n')


'''

'5001': '房屋建筑',
'5002': '土木工程建筑',
'5003': '建筑安装业',
'5004': '建筑装饰、装修和其他建筑业',

'''


def set_id(title):
    item = {}
    # 5001
    if '房屋' in title:
        for i, c in cate1.items():

            if c in title:

                if len(i) < 8:
                    i = i + '001'

                item['p_id'] = i
                item['region'] = c
                # print(item)
                return item

        item['p_id'] = '5001039'
        item['region'] = '全国'
        # print(item)
        return item

    # 5002
    elif '工程' in title:
        for i, c in cate2.items():

            if c in title:

                if len(i) < 8:
                    i = i + '001'

                item['p_id'] = i
                item['region'] = c
                # print(item)
                return item

        item['p_id'] = '5002039'
        item['region'] = '全国'
        # print(item)
        return item

    # 5003
    elif '安装' in title:
        for i, c in cate3.items():

            if c in title:

                if len(i) < 8:
                    i = i + '001'

                item['p_id'] = i
                item['region'] = c
                # print(item)
                return item

        item['p_id'] = '5003039'
        item['region'] = '全国'
        # print(item)
        return item

    # 5004
    else:
        for i, c in cate4.items():

            if c in title:

                if len(i) < 8:
                    i = i + '001'

                item['p_id'] = i
                item['region'] = c
                # print(item)
                return item

        item['p_id'] = '5004039'
        item['region'] = '全国'
        # print(item)
        return item


if __name__ == '__main__':
    title = '北京，房屋'
    set_id(title)


# prevince = {'5001005': '安徽', '5001006': '澳门', '5001007': '北京',
#             "5001007001": "全市",
#             '5001008': '重庆',
#                 "5001007001": "全市",
# '5001009': '福建', '5001010': '甘肃',
#             '5001011': '广东', '5001012': '广西', '5001013': '贵州', '5001014': '海南', '5001015': '河北', '5001016': '黑龙江',
#             '5001017': '河南', '5001018': '湖北', '5001019': '湖南', '5001020': '江苏', '5001021': '江西', '5001022': '吉林',
#             '5001023': '辽宁', '5001024': '内蒙古', '5001025': '宁夏', '5001026': '青海', '5001027': '山东', '5001028': '上海',
#             '5001029': '陕西', '5001030': '山西', '5001031': '四川', '5001032': '台湾', '5001033': '天津', '5001034': '香港',
#             '5001035': '新疆', '5001036': '西藏', '5001037': '云南', '5001038': '浙江',
#
#             '5002005': '安徽', '5002006': '澳门', '5002007': '北京',
#             "5001007001": "全市",
#             '5002008': '重庆',
#                 "5001007001": "全市",
# '5002009': '福建', '5002010': '甘肃',
#             '5002011': '广东', '5002012': '广西', '5002013': '贵州', '5002014': '海南', '5002015': '河北', '5002016': '黑龙江',
#             '5002017': '河南', '5002018': '湖北', '5002019': '湖南', '5002020': '江苏', '5002021': '江西', '5002022': '吉林',
#             '5002023': '辽宁', '5002024': '内蒙古', '5002025': '宁夏', '5002026': '青海', '5002027': '山东', '5002028': '上海',
#             '5002029': '陕西', '5002030': '山西', '5002031': '四川', '5002032': '台湾', '5002033': '天津', '5002034': '香港',
#             '5002035': '新疆', '5002036': '西藏', '5002037': '云南', '5002038': '浙江',
#
#             '5003005': '安徽', '5003006': '澳门', '5003007': '北京',
#             "5001007001": "全市",
#             '5003008': '重庆',
#                 "5001007001": "全市",
# '5003009': '福建', '5003010': '甘肃',
#             '5003011': '广东', '5003012': '广西', '5003013': '贵州', '5003014': '海南', '5003015': '河北', '5003016': '黑龙江',
#             '5003017': '河南', '5003018': '湖北', '5003019': '湖南', '5003020': '江苏', '5003021': '江西', '5003022': '吉林',
#             '5003023': '辽宁', '5003024': '内蒙古', '5003025': '宁夏', '5003026': '青海', '5003027': '山东', '5003028': '上海',
#             '5003029': '陕西', '5003030': '山西', '5003031': '四川', '5003032': '台湾', '5003033': '天津', '5003034': '香港',
#             '5003035': '新疆', '5003036': '西藏', '5003037': '云南', '5003038': '浙江',
#
#             '5004005': '安徽', '5004006': '澳门', '5004007': '北京',
#             "5001007001": "全市",
#             '5004008': '重庆',
#                 "5001007001": "全市",
# '5004009': '福建', '5004010': '甘肃',
#             '5004011': '广东', '5004012': '广西', '5004013': '贵州', '5004014': '海南', '5004015': '河北', '5004016': '黑龙江',
#             '5004017': '河南', '5004018': '湖北', '5004019': '湖南', '5004020': '江苏', '5004021': '江西', '5004022': '吉林',
#             '5004023': '辽宁', '5004024': '内蒙古', '5004025': '宁夏', '5004026': '青海', '5004027': '山东', '5004028': '上海',
#             '5004029': '陕西', '5004030': '山西', '5004031': '四川', '5004032': '台湾', '5004033': '天津', '5004034': '香港',
#             '5004035': '新疆', '5004036': '西藏', '5004037': '云南', '5004038': '浙江'}
